#+STARTUP: showall

*** Additional python packages to install

Put your cursor in this code block and run it (C-c C-c). This will install some additional packages we will use in the course.

#+BEGIN_SRC python
from setuptools.command import easy_install

for pkg in ['pycse', 'quantities', 'pint',
            'uncertainties', 'jedi', 'rope']:
    easy_install.main(['-U', pkg])
#+END_SRC

After you install those, this code block will tell you about the installed versions of the most important libraries we will use in Python.

#+BEGIN_SRC python
import numpy
print('numpy version {}'.format(numpy.__version__))

import scipy
print('scipy version {}'.format(scipy.__version__))

import matplotlib
print('matplotlib version {}'.format(matplotlib.__version__))

import quantities
print('quantities version {}'.format(quantities.__version__))

import uncertainties 
print('uncertainties version {}'.format(uncertainties.__version__))
#+END_SRC

#+RESULTS:
: numpy version 1.8.0
: scipy version 0.14.0
: matplotlib version 1.3.1
: quantities version 0.10.1
: uncertainties version 2.4.6

